{
    "portfolio":
        {
            
            "title": "Portfolio website .M",
            "img": "../../../../assets/images/projects/portfolio/portfolio.gif",
            "technologies": [ "angular", "html", "scss"],            
            "title1": "Personal portfolio website",
            "desc1": "This is my first personal portfolio website. A website that in a way represents me, and showcases what I am all about. To build this website I used HTML, CSS (SCSS) and Angular framework. It is devided in different sections: short intro, projects, about me and get in touch sections. Each section has it's own characteristics.",
            "sections": [
                {
                    "title": "Project section",
                    "desc": "Section to showcase projects done by me, as well as the projects that are on their way. Each card represents a different project and it is a link to a page that gives more info about the displayed project as well as screenshots or videos of the project. To  make the section more suitable for the viewer each odd/even card is colored differently. ",
                    "img": "../../../../assets/images/projects/portfolio/projectssection.jpg"
                },
                {
                    "title": "About me section",
                    "desc": "About me section gives full details about the developer (me). It is a section that gives a chance to personaly get to know the author a little better. It contains the subsection to showcase all the technologies that the author enjoys learning and using to create applications.",
                    "img": "../../../../assets/images/projects/portfolio/aboutmeSection.jpg"
                },
                {
                    "title": "Project page",
                    "desc": "Project page gives a full description of the selected project. It showcases most of the project sections and describes their use, as well as it provides links to Github repository of the project and live demo links if they exist. This page includes mockup images of websites or aplications, as well as full list of technologies used to build it.",
                    "img": "../../../../assets/images/projects/portfolio/projectPage.jpg"
                }
            ],
            "githubLink": "http://www.github.com",
            "liveDemo": "http://shiziks.github.io"
        },
        "oggyportfolio":
        {
            
            "title": "Portfolio website Oggy",
            "img": "../../../../assets/images/projects/oggyportfolio/oggy.gif",
            "technologies": [ "angular", "html", "css"],            
            "title1": "Graphic designer portfolio website",
            "desc1": "This was the first project I worked on while learning Angular framework. I was inspired to do a personal portfolio presentation because I wanted the experience of making a personal website. All images used for this project are not my own property, but borrowed from the internet.",
            "sections": [
                {
                    "title": "About me section",
                    "desc": "About me section gives full details about the developer. It is a section that gives a chance to personaly get to know the author a little better. It contains the subsection to showcase all the technologies that the author enjoys learning and using to create applications.",
                    "img": "../../../../assets/images/projects/oggyportfolio/oggymobile.jpg"
                },
                {
                    "title": "Project section",
                    "desc": "Section to showcase projects done by me, as well as the projects that are on their way. Each card represents a different project and it is a link to a page that gives more info about the displayed project. To  make the section more suitable for the viewer each odd/even card is colored differently. ",
                    "img": "../../../../assets/images/projects/oggyportfolio/oggy2.jpg"
                },
                {
                    "title": "Project page",
                    "desc": "Project page gives a full description of the selected project. It showcases most of the project sections and describes their use, as well as it provides links to Github repository of the project and live demo links. This page includes mockup images of websites or aplications, as well as full list of technologies used to build it.",
                    "img": "../../../../assets/images/projects/oggyportfolio/oggy3.jpg"
                }
            ],
            "githubLink": "https://github.com/Shiziks/Oggy",
            "liveDemo": "https://oggyportfolio.netlify.app/"
        },
        "pophelanke":
        {
            
            "title": "Pop helanke web shop",
            "img": "../../../../assets/images/projects/pophelanke/pophelanke.gif",
            "technologies": [ "php", "javascript", "jquery", "html", "css"],            
            "title1": "Leggings web shop.",
            "desc1": "This project was a school project, done as an assignment while learning PHP and implementing JavaScript knowledge. The assignment was to build a website using an existing HTML and CSS theme and implementing Javascript functions as well as communication with Database via ajax and php.",
            "sections": [
                {
                    "title": "Index page",
                    "desc": "Index page is a typical home page for a webshop, showcasing offers, collections and categories to look through. Each section is a link for another page that displays the category coresponding to the section.",
                    "img": "../../../../assets/images/projects/pophelanke/pophelankeindextablet.jpg"
                },
                {
                    "title": "Shop section",
                    "desc": "Shop section offers user a possibility to filter the leggings by the category, color or price. Each product can be added to cart, but the cart will be accessible only to logged in users. The items are shown in rows and each time a user decides on the filter new query is made, and the results are used to load new page contents.",
                    "img": "../../../../assets/images/projects/pophelanke/pophelankeshop.jpg"
                },
                {
                    "title": "Shopping cart",
                    "desc": "Shopping cart page is accessible only to logged in users. The page gets populated with content once the user has some items placed in the cart. Here, user can decide weather to delete some items from the cart or to keep them in the cart. If the user adds more items to the cart, there is a button for updating the cart so all items are updated.",
                    "img": "../../../../assets/images/projects/pophelanke/pophelankecart.jpg"
                }
            ],
            "githubLink": "https://github.com/Shiziks/Pophelanke",
            "liveDemo": "https://pophelanke.000webhostapp.com/"
        },
        "viaolivia":
        {
            
            "title": "Via Olivia web shop",
            "img": "../../../../assets/images/projects/viaolivija/viaolivijaindex.jpg",
            "technologies": [ "angular", "typescript", "html", "css"],            
            "title1": "Via Olivia shop.",
            "desc1": "This is a project I am currently working on. It is a webshop for different kinds of food products.",
            "sections": [
                {
                    "title": "Under construction page",
                    "desc": "This page is not an usual under construction page, but a page to let people know when the shop will be opened and give them an opportunity to subscribe to a newsletter and get notified once the shop is fully functioning or there are any other news. Mailerlite is implemented to be used as a newsletter subscription app.",
                    "img": "../../../../assets/images/projects/viaolivija/viaoliviasubscribed.jpg"
                }
            ],
            "githubLink": "https://github.com/Shiziks",
            "liveDemo": "http://viaolivia.rs/"
        },
        "stretchingapp":
        {
            
            "title": "StretchWay web app",
            "img": "../../../../assets/images/projects/stretchingapp/stretchway.jpeg",
            "technologies": [ "angular", "typescript", "html", "css"],            
            "title1": "StretchWay web app.",
            "desc1": "A project I made for personal use. This is a project that took me around a week to be completely done, with the full design of the page. I made it as a pesonal tool for stretching, so that I am able to more easily follow the routine I usually do after working out.",
            "sections": [
                {
                    "title": "Intro screen",
                    "desc": "Idea behind this app is that it will be mostly used on mobile phones, so the intro screen is made to mimic the loading of mobile app and be a welcoming message for the user. This screen is visible only for 5 seconds and after that the user is redirected to the homepage of the app.",
                    "img": "../../../../assets/images/projects/stretchingapp/IntroPage.jpg"
                },
                {
                    "title": "Home page",
                    "desc": "The home page serves as guide for the futher use of the app. On this screen the user can choose which body part they want to stretch in that session or choose to stretch the whole body. Also highlighted in green there is a guide how this stretching approach actually works and should be used. This page is made to be intuitive for the user to easily navigate through it and all the given options.",
                    "img": "../../../../assets/images/projects/stretchingapp/homePage.jpg"
                },
                {
                    "title": "Stretch page",
                    "desc": "Once a user selects a part of body they want to stretch a stretch page is shown to them. This page shows the stretch with the name of the stretch underneath and options to start and stop the time right underneath. Each stretch has a description, or ques a user should follow and they are accessible by clicking/taping on the name of the stretch. Once the times starts, the start buttin becomes disabled until the user taps/clicks on the stop button. The timer counts down from 30 seconds to 0 and once it reaches 0 the notification sound activates. This feature is added because my personal experience with the app.",
                    "img": "../../../../assets/images/projects/stretchingapp/stretchPage.jpg"
                },
                {
                    "title": "Help page",
                    "desc": "Help page is intended to be used by first time users or users who need more explanation about this stretching approach. It covers all the key questions about the approach and how to properly use an app so that you can see the results. It is devided in sections, and each section covers a different question about the approach or the app itself.",
                    "img": "../../../../assets/images/projects/stretchingapp/helpPage.jpg"
                }
            ],
            "githubLink": "https://github.com/Shiziks/stretchway",
            "liveDemo": "https://stretchway.netlify.app/"
        },
        "melog":
        {
            
            "title": "Diary application - MeLog",
            "img": "../../../../assets/images/projects/melog/melogscreens.jpg",
            "technologies": [ "angular","php","html", "css", "mysql"],            
            "title1": "A personal diary website",
            "desc1": "This is the biggest project I made so far. It was a final project for the Computer Science batchelor degree and it took me around 6 months to completely design, program and secure the app. I personly picked the theme because journaling is something I enjoy, and I wanted to make a web app that has the features that I am using and couldn't find in other apps online.",
            "sections": [
                {
                    "title": "Landing page",
                    "desc": "Landing page is there to represent the whole project to future users. It is divided in sections, and each section represents one feature of the diary app. Underneath each section there is a hook button for an easy access to register or login page.",
                    "img": "../../../../assets/images/projects/melog/landingpagegif.gif"
                },
                {
                    "title": "User Profile",
                    "desc": "User profile can be accessed after successful login, or register process. It is a personal diary profile that contains multiple different options for user. A user can log and track their: mood, energy, sleep hours, water intake, weather they worked out or not, how many steps did they take, what they are grateful for and write a day log. All of these options are placed in cards that have an option to be turned off, if the user doesn't want to track that option.",
                    "img": "../../../../assets/images/projects/melog/profile.gif"
                },
                {
                    "title": "Charts page",
                    "desc": "Tracking anything wouldn't make any sense if we didn't have an option to analyze the tracked data. This is why a user can access the chart representation of their own logs. They can track their progress through time and get a visual representation in the form of line chart or pie chart. They can also filter the data in any way that is more suitable for them.",
                    "img": "../../../../assets/images/projects/melog/charts.gif"
                },
                {
                    "title": "Day logs",
                    "desc": "MeLog app couldn't be called a diary if it only had an option to track different things. This is why any user can actually use day log card to write their on diary logs, and add images. Any user can review their past logs, filter them, and access a separate page for displaying the log where they can change it or decide to delete it.",
                    "img": "../../../../assets/images/projects/melog/daylog.gif"
                },
                {
                    "title": "Gratitude logs",
                    "desc": "Gratitude log is meant to motivate a user to start writing a gratitude diary and by doing that the user is working on being more mindful and present. Just like with Day Logs user can review all past Gratitude logs and delete any if they want.",
                    "img": "../../../../assets/images/projects/melog/gratitudes.gif"
                },
                {
                    "title": "Profile settings page",
                    "desc": "Every user, after logging in process, has access to Profile settings page. Here they can change their personal data, as well as add, change or remove profile images. They can change password, and decide if they want to turn on or off any profile option. Lastly they can also leave a review of the app, and choose weather they want it to be anonymous or not.",
                    "img": "../../../../assets/images/projects/melog/profilesettings.gif"
                },
                {
                    "title": "Admin page",
                    "desc": "Admin page is accessible only to logged in users who also have an admin role. Admins can change the view of the user profile by changing the icons used to represent different options. They can add or delete welcoming images. They can change, add or delete inspirational quotes and affirmations that are showed to user. And they can make new admin user or remove admin role from another admin.",
                    "img": "../../../../assets/images/projects/melog/admin.gif"
                }
            ],
            "video": {
                "title": "App video",
                "desc": "This is an app walktrough video I made with a purpose of presenting my work. Please take time and see all the app features to get a better understanding of app functionalities. Under the video you can find links for the Github project as well as the live version of the frontend part of the application.",
                "video":"https://player.vimeo.com/video/839473788?badge=0&amp;autopause=0&amp;player_id=0&amp;app_id=58479"
            },
            "githubLink": "https://github.com/Shiziks/diaryback",
            "liveDemo": "https://melogdiary.vercel.app/home"
        }
    
}